zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/Device/SiliconLabs/MGM26/Include/mgm26_prs_signals.h
/**************************************************************************//**
 * @file
 * @brief MGM26 PRS register signal bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2026 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef MGM26_PRS_SIGNALS_H
#define MGM26_PRS_SIGNALS_H

/** Synchronous signal sources enumeration: */
#define _PRS_SYNC_CH_CTRL_SOURCESEL_NONE                   (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_TIMER0                 (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_TIMER1                 (0x00000002UL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_IADC0                  (0x00000003UL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_TIMER2                 (0x00000004UL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_TIMER3                 (0x00000005UL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_TIMER4                 (0x00000006UL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_VDAC0                  (0x00000007UL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_VDAC1                  (0x00000008UL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_TIMER5                 (0x00000009UL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_TIMER6                 (0x0000000aUL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_TIMER7                 (0x0000000bUL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_TIMER8                 (0x0000000cUL)
#define _PRS_SYNC_CH_CTRL_SOURCESEL_TIMER9                 (0x0000000dUL)

/** Synchronous signal sources enumeration aligned with register bit field: */
#define PRS_SYNC_CH_CTRL_SOURCESEL_NONE                    (_PRS_SYNC_CH_CTRL_SOURCESEL_NONE << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_TIMER0                  (_PRS_SYNC_CH_CTRL_SOURCESEL_TIMER0 << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_TIMER1                  (_PRS_SYNC_CH_CTRL_SOURCESEL_TIMER1 << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_IADC0                   (_PRS_SYNC_CH_CTRL_SOURCESEL_IADC0 << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_TIMER2                  (_PRS_SYNC_CH_CTRL_SOURCESEL_TIMER2 << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_TIMER3                  (_PRS_SYNC_CH_CTRL_SOURCESEL_TIMER3 << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_TIMER4                  (_PRS_SYNC_CH_CTRL_SOURCESEL_TIMER4 << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_VDAC0                   (_PRS_SYNC_CH_CTRL_SOURCESEL_VDAC0 << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_VDAC1                   (_PRS_SYNC_CH_CTRL_SOURCESEL_VDAC1 << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_TIMER5                  (_PRS_SYNC_CH_CTRL_SOURCESEL_TIMER5 << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_TIMER6                  (_PRS_SYNC_CH_CTRL_SOURCESEL_TIMER6 << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_TIMER7                  (_PRS_SYNC_CH_CTRL_SOURCESEL_TIMER7 << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_TIMER8                  (_PRS_SYNC_CH_CTRL_SOURCESEL_TIMER8 << 8)
#define PRS_SYNC_CH_CTRL_SOURCESEL_TIMER9                  (_PRS_SYNC_CH_CTRL_SOURCESEL_TIMER9 << 8)

/** Synchronous signals enumeration: */
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER0UF                  (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER0OF                  (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER0CC0                 (0x00000002UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER0CC1                 (0x00000003UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER0CC2                 (0x00000004UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER1UF                  (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER1OF                  (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER1CC0                 (0x00000002UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER1CC1                 (0x00000003UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER1CC2                 (0x00000004UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_IADC0SCANENTRYDONE        (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_IADC0SCANTABLEDONE        (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_IADC0SINGLEDONE           (0x00000002UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER2UF                  (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER2OF                  (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER2CC0                 (0x00000002UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER2CC1                 (0x00000003UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER2CC2                 (0x00000004UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER3UF                  (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER3OF                  (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER3CC0                 (0x00000002UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER3CC1                 (0x00000003UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER3CC2                 (0x00000004UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER4UF                  (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER4OF                  (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER4CC0                 (0x00000002UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER4CC1                 (0x00000003UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER4CC2                 (0x00000004UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_VDAC0CH0DONESYNC          (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_VDAC0CH1DONESYNC          (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_VDAC1CH0DONESYNC          (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_VDAC1CH1DONESYNC          (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER5UF                  (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER5OF                  (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER5CC0                 (0x00000002UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER5CC1                 (0x00000003UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER5CC2                 (0x00000004UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER6UF                  (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER6OF                  (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER6CC0                 (0x00000002UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER6CC1                 (0x00000003UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER6CC2                 (0x00000004UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER7UF                  (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER7OF                  (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER7CC0                 (0x00000002UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER7CC1                 (0x00000003UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER7CC2                 (0x00000004UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER8UF                  (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER8OF                  (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER8CC0                 (0x00000002UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER8CC1                 (0x00000003UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER8CC2                 (0x00000004UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER9UF                  (0x00000000UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER9OF                  (0x00000001UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER9CC0                 (0x00000002UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER9CC1                 (0x00000003UL)
#define _PRS_SYNC_CH_CTRL_SIGSEL_TIMER9CC2                 (0x00000004UL)

/** Synchronous signals enumeration aligned with register bit field: */
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER0UF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER0UF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER0OF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER0OF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER0CC0                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER0CC0 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER0CC1                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER0CC1 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER0CC2                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER0CC2 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER1UF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER1UF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER1OF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER1OF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER1CC0                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER1CC0 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER1CC1                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER1CC1 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER1CC2                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER1CC2 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_IADC0SCANENTRYDONE         (_PRS_SYNC_CH_CTRL_SIGSEL_IADC0SCANENTRYDONE << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_IADC0SCANTABLEDONE         (_PRS_SYNC_CH_CTRL_SIGSEL_IADC0SCANTABLEDONE << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_IADC0SINGLEDONE            (_PRS_SYNC_CH_CTRL_SIGSEL_IADC0SINGLEDONE << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER2UF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER2UF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER2OF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER2OF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER2CC0                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER2CC0 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER2CC1                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER2CC1 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER2CC2                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER2CC2 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER3UF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER3UF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER3OF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER3OF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER3CC0                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER3CC0 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER3CC1                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER3CC1 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER3CC2                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER3CC2 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER4UF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER4UF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER4OF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER4OF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER4CC0                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER4CC0 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER4CC1                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER4CC1 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER4CC2                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER4CC2 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_VDAC0CH0DONESYNC           (_PRS_SYNC_CH_CTRL_SIGSEL_VDAC0CH0DONESYNC << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_VDAC0CH1DONESYNC           (_PRS_SYNC_CH_CTRL_SIGSEL_VDAC0CH1DONESYNC << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_VDAC1CH0DONESYNC           (_PRS_SYNC_CH_CTRL_SIGSEL_VDAC1CH0DONESYNC << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_VDAC1CH1DONESYNC           (_PRS_SYNC_CH_CTRL_SIGSEL_VDAC1CH1DONESYNC << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER5UF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER5UF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER5OF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER5OF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER5CC0                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER5CC0 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER5CC1                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER5CC1 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER5CC2                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER5CC2 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER6UF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER6UF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER6OF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER6OF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER6CC0                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER6CC0 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER6CC1                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER6CC1 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER6CC2                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER6CC2 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER7UF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER7UF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER7OF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER7OF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER7CC0                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER7CC0 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER7CC1                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER7CC1 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER7CC2                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER7CC2 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER8UF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER8UF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER8OF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER8OF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER8CC0                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER8CC0 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER8CC1                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER8CC1 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER8CC2                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER8CC2 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER9UF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER9UF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER9OF                   (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER9OF << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER9CC0                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER9CC0 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER9CC1                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER9CC1 << 0)
#define PRS_SYNC_CH_CTRL_SIGSEL_TIMER9CC2                  (_PRS_SYNC_CH_CTRL_SIGSEL_TIMER9CC2 << 0)

